app/helpers/sessions_helper.rb

  def current_user
    if session[:user_id]
      User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 29 LIMIT 1