app/helpers/sessions_helper.rb

  def current_user
    if (user_id = session[:user_id]) # knowsonly about the temporary session # not is a comparison
      @current_user ||= User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 35 LIMIT 1