app/controllers/users_controller.rb

  def index
    # @users = User.all
    @users = User.paginate(page: params[:page])
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('nguyengocnam', 'xxx@gmail.com', '2023-02-09 13:00:56.430031', '2023-02-09 13:00:56.430031', '$2a$10$Gir8WOQpv1rmSgVO3ElunOecsuemyPK2Gdupi81LlutuO07gAS3EW')

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 35 LIMIT 1
UPDATE `users` SET `users`.`name` = 'nguyenngocnam123', `users`.`updated_at` = '2023-02-09 08:17:00.953064', `users`.`password_digest` = '$2a$10$MUn60XaR0HPcfr0KV7phtuP8HvjVBx4P8msj5ZqvsIWvmsnwiUv1O' WHERE `users`.`id` = 35